# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']
# ???
index_name = 0
for i in names:  
    print(names[index_name])
    index_name +=1


# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём
# Пример вывода:
# Оля: 3
# Петя: 4

names = ['Оля', 'Петя', 'Вася', 'Маша']
# ???
index_name = 0
for i in names:  
    print(names[index_name], ':', (len(names[index_name])))
    index_name +=1

# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
    'Оля': False,  # если False, то пол женский
    'Петя': True,  # если True, то пол мужской
    'Вася': True,
    'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша']
# ???
s = 0
while s == len(names):
    if is_male[names[s]] == False:
        print(names[s], 'женский')
    else:
        print(names[s], 'мужской')
    s +=1
#нет мыслей по поводу реализации этого задания





# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# Группа 1: 2 ученика.
# Группа 2: 4 ученика.

groups = [
    ['Вася', 'Маша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
    ['Оля', 'Петя', 'Гриша'],
]
# ???
print('Всего', len(groups), 'группы')
len_grup = 0
min_value_groups = 1
while len_grup != len(groups):
    print('Группа', min_value_groups, ':', len(groups[len_grup]), 'ученика.')
    len_grup +=1
    min_value_groups +=1


# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят
# Пример вывода:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
    ['Вася', 'Маша'],
    ['Оля', 'Петя', 'Гриша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
]
# ???
len_grup = 0
min_value_groups = 1
while len_grup != len(groups):
    print('Группа', min_value_groups, ':', " ".join(groups[len_grup
    ]))
    len_grup +=1
    min_value_groups +=1